package javarush.Kodesource;
/*
20. Напишите Java-программу для преобразования десятичного числа в шестнадцатеричное число.
Входные данные:
Введите десятичное число: 15
Ожидаемый результат

 Шестнадцатеричное число: F
 */
public class Part1_20 {
    public static void main(String[] args) {
        int a = 15;
        System.out.println(Integer.toHexString(15));
    }
}
